# IsConnectingEdge Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..IsConnectingEdge Method
Form Class See Also
---
Tell if an edge is a connecting edge on a side face. Connecting edges connect vertices on different profiles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsConnectingEdge(
	Reference edgeReference
)
```

Visual Basic
---
```text
Public Function IsConnectingEdge ( _
	edgeReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
bool IsConnectingEdge(
	Reference^ edgeReference
)
```

# ### Parameters
edgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe reference of the edge to be checked.
# See Also
Form Class
Autodesk.Revit.DB Namespace